# JoistSystemElemTagNewMembersView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..JoistSystemElemTagNewMembersView Property
ParameterTypeId Class See Also
---
"Tag new members in view"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId JoistSystemElemTagNewMembersView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JoistSystemElemTagNewMembersView As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ JoistSystemElemTagNewMembersView {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace